# Electronics Online Store

## Introduction:
Welcome to my comprehensive data analysis portfolio, where I delve into the purchase data collected from a large home appliances and electronics online store. The dataset spans from January 2020 to November 2020, providing a rich source of information about the interactions between products and users.

The dataset, obtained through the Open CDP project, captures events related to product transactions. Each row in the file signifies an event, representing a many-to-many relationship between products and users. This unique perspective allows for a thorough exploration of customer behavior, product performance, and valuable business insights.

Throughout this portfolio, I leverage my skills as a data analyst to unravel patterns, trends, and meaningful correlations within this extensive dataset. The data, sourced from an open customer data platform, enables a deep dive into the dynamics of an online store, offering opportunities to extract actionable insights and recommendations.

Feel free to join me on this analytical journey as we unlock the potential hidden within the realms of home appliances and electronics purchase data.

### Import dataset to a table

In [1]:
import pandas as pd
from sqlalchemy import create_engine, types

conn_string = 'postgresql://postgres:Ninz123!@localhost:54320/electronics'
db = create_engine(conn_string)
conn = db.connect()

df = pd.read_csv('E:\portfolio\electronics_store\kz.csv') 
dtype_mapping = {
    'event_time': types.TIMESTAMP(timezone=True),
    'order_id': types.String(length=255),
    'product_id': types.String(length=255),
    'category_id': types.String(length=255),
    'category_code': types.String(length=255),
    'brand': types.String(length=255),
    'price': types.Numeric(),
    'user_id': types.String(length=255)
    # Add more columns as needed
}

df.to_sql('e_data', con=conn, if_exists='replace', index=False, dtype=dtype_mapping)

521

### Connecting to the database and loading configurations

In [1]:
%load_ext sql

In [3]:
%sql postgresql://postgres:Ninz123!@localhost:54320/electronics

Connecting to 'postgresql://postgres:***@localhost:54320/electronics'

In [5]:
%config SqlMagic.displaylimit = 0

In [6]:
%config SqlMagic.displaycon = False

## Data Exploration:

### Check column types

In [6]:
%%jupysql

SELECT column_name, data_type
FROM information_schema.columns
WHERE table_name = 'e_data';

8 rows affected.

+---------------+--------------------------+
|  column_name  |        data_type         |
+---------------+--------------------------+
|     price     |         numeric          |
|   event_time  | timestamp with time zone |
|   product_id  |    character varying     |
|  category_id  |    character varying     |
| category_code |    character varying     |
|     brand     |    character varying     |
|    user_id    |    character varying     |
|    order_id   |    character varying     |
+---------------+--------------------------+

### A quick glimpse into the content of the dataset by displaying the first 10 records.

In [7]:
%%jupysql

SELECT * FROM e_data 
LIMIT 10;

10 rows affected.

+---------------------------+---------------------+---------------------+---------------------+-----------------------------+---------+---------+---------------------+
|         event_time        |       order_id      |      product_id     |     category_id     |        category_code        |  brand  |  price  |       user_id       |
+---------------------------+---------------------+---------------------+---------------------+-----------------------------+---------+---------+---------------------+
| 2020-04-24 11:50:39+00:00 | 2294359932054536986 | 1515966223509089906 | 2268105426648171000 |      electronics.tablet     | samsung |  162.01 | 1515915625441994000 |
| 2020-04-24 11:50:39+00:00 | 2294359932054536986 | 1515966223509089906 | 2268105426648171000 |      electronics.tablet     | samsung |  162.01 | 1515915625441994000 |
| 2020-04-24 14:37:43+00:00 | 2294444024058086220 | 2273948319057183658 | 2268105430162997800 | electronics.audio.headphone |  huawei |  77.52  | 1515915625447879400 |
| 2020-04-24 14:37:43+00:00 | 2294444024058086220 | 2273948319057183658 | 2268105430162997800 | electronics.audio.headphone |  huawei |  77.52  | 1515915625447879400 |
| 2020-04-24 19:16:21+00:00 | 2294584263154074236 | 2273948316817424439 | 2268105471367840000 |             None            | karcher |  217.57 | 1515915625443148000 |
| 2020-04-26 08:45:57+00:00 | 2295716521449619559 | 1515966223509261697 | 2268105442636858000 |   furniture.kitchen.table   | maestro |  39.33  | 1515915625450382800 |
| 2020-04-26 09:33:47+00:00 | 2295740594749702229 | 1515966223509104892 | 2268105428166509000 |    electronics.smartphone   |  apple  | 1387.01 | 1515915625448766500 |
| 2020-04-26 09:33:47+00:00 | 2295740594749702229 | 1515966223509104892 | 2268105428166509000 |    electronics.smartphone   |  apple  | 1387.01 | 1515915625448766500 |
| 2020-04-26 09:33:47+00:00 | 2295740594749702229 | 1515966223509104892 | 2268105428166509000 |    electronics.smartphone   |  apple  | 1387.01 | 1515915625448766500 |
| 2020-04-26 09:33:47+00:00 | 2295740594749702229 | 1515966223509104892 | 2268105428166509000 |    electronics.smartphone   |  apple  | 1387.01 | 1515915625448766500 |
+---------------------------+---------------------+---------------------+---------------------+-----------------------------+---------+---------+---------------------+

### Check for 0 or NULL values

In [7]:
%%jupysql

WITH MissingValuesCTE AS (
    SELECT
        'empty_event_time' AS column_name,
        COUNT(CASE WHEN event_time IS NULL THEN 1 END) AS missing_count,
        ROUND(COUNT(CASE WHEN event_time IS NULL THEN 1 END) * 100.0 / COUNT(*), 2) AS percentage
    FROM e_data
    UNION
    SELECT
        'empty_order_id' AS column_name,
        COUNT(CASE WHEN order_id IS NULL THEN 1 END) AS missing_count,
        ROUND(COUNT(CASE WHEN order_id IS NULL THEN 1 END) * 100.0 / COUNT(*), 2) AS percentage
    FROM e_data
    UNION
    SELECT
        'empty_product_id' AS column_name,
        COUNT(CASE WHEN product_id IS NULL THEN 1 END) AS missing_count,
        ROUND(COUNT(CASE WHEN product_id IS NULL THEN 1 END) * 100.0 / COUNT(*), 2) AS percentage
    FROM e_data
    UNION
    SELECT
        'empty_category_id' AS column_name,
        COUNT(CASE WHEN category_id IS NULL THEN 1 END) AS missing_count,
        ROUND(COUNT(CASE WHEN category_id IS NULL THEN 1 END) * 100.0 / COUNT(*), 2) AS percentage
    FROM e_data
    UNION
    SELECT
        'empty_category_code' AS column_name,
        COUNT(CASE WHEN category_code IS NULL THEN 1 END) AS missing_count,
        ROUND(COUNT(CASE WHEN category_code IS NULL THEN 1 END) * 100.0 / COUNT(*), 2) AS percentage
    FROM e_data
    UNION
    SELECT
        'empty_brand' AS column_name,
        COUNT(CASE WHEN brand IS NULL THEN 1 END) AS missing_count,
        ROUND(COUNT(CASE WHEN brand IS NULL THEN 1 END) * 100.0 / COUNT(*), 2) AS percentage
    FROM e_data
    UNION
    SELECT
        'empty_price' AS column_name,
        COUNT(CASE WHEN price = 0 OR price IS NULL THEN 1 END) AS missing_count,
        ROUND(COUNT(CASE WHEN price = 0 OR price IS NULL THEN 1 END) * 100.0 / COUNT(*), 2) AS percentage
    FROM e_data
    UNION
    SELECT
        'empty_user_id' AS column_name,
        COUNT(CASE WHEN user_id IS NULL THEN 1 END) AS missing_count,
        ROUND(COUNT(CASE WHEN user_id IS NULL THEN 1 END) * 100.0 / COUNT(*), 2) AS percentage
    FROM e_data
)

SELECT
    column_name,
    missing_count,
    percentage
FROM MissingValuesCTE
ORDER BY
    CASE
        WHEN column_name = 'empty_event_time' THEN 1
        WHEN column_name = 'empty_order_id' THEN 2
        WHEN column_name = 'empty_product_id' THEN 3
        WHEN column_name = 'empty_category_id' THEN 4
        WHEN column_name = 'empty_category_code' THEN 5
        WHEN column_name = 'empty_brand' THEN 6
        WHEN column_name = 'empty_price' THEN 7
        WHEN column_name = 'empty_user_id' THEN 8
    END;

8 rows affected.

+---------------------+---------------+------------+
|     column_name     | missing_count | percentage |
+---------------------+---------------+------------+
|   empty_event_time  |       0       |    0.00    |
|    empty_order_id   |       0       |    0.00    |
|   empty_product_id  |       0       |    0.00    |
|  empty_category_id  |     431954    |   16.40    |
| empty_category_code |     612202    |   23.25    |
|     empty_brand     |     506005    |   19.21    |
|     empty_price     |     432075    |   16.41    |
|    empty_user_id    |    2069352    |   78.58    |
+---------------------+---------------+------------+

## Data Cleaning:

### Create a new table to  include unique entries with price > 0.

In [14]:
%%jupysql

DROP TABLE IF EXISTS clean_e_data;

CREATE TABLE clean_e_data AS
SELECT DISTINCT *
FROM e_data
WHERE price > 0;

2200772 rows affected.

++
||
++
++

### Check if there are remaining duplicates

In [15]:
%%jupysql

WITH duplicates_cte AS (
  SELECT 
    *,
    ROW_NUMBER() OVER (PARTITION BY 
      event_time,
      order_id,
      product_id,
      category_id,
      category_code,
      brand,
      price,
      user_id) AS row_num
  FROM clean_e_data
)
SELECT *
FROM duplicates_cte
WHERE row_num > 1;

+------------+----------+------------+-------------+---------------+-------+-------+---------+---------+
| event_time | order_id | product_id | category_id | category_code | brand | price | user_id | row_num |
+------------+----------+------------+-------------+---------------+-------+-------+---------+---------+
+------------+----------+------------+-------------+---------------+-------+-------+---------+---------+

### Check updated NULL values in clean_e_data table

In [7]:
%%jupysql

WITH MissingValuesCTE AS (
    SELECT
        'empty_event_time' AS column_name,
        COUNT(CASE WHEN event_time IS NULL THEN 1 END) AS missing_count,
        ROUND(COUNT(CASE WHEN event_time IS NULL THEN 1 END) * 100.0 / COUNT(*), 2) AS percentage
    FROM clean_e_data
    UNION
    SELECT
        'empty_order_id' AS column_name,
        COUNT(CASE WHEN order_id IS NULL THEN 1 END) AS missing_count,
        ROUND(COUNT(CASE WHEN order_id IS NULL THEN 1 END) * 100.0 / COUNT(*), 2) AS percentage
    FROM clean_e_data
    UNION
    SELECT
        'empty_product_id' AS column_name,
        COUNT(CASE WHEN product_id IS NULL THEN 1 END) AS missing_count,
        ROUND(COUNT(CASE WHEN product_id IS NULL THEN 1 END) * 100.0 / COUNT(*), 2) AS percentage
    FROM clean_e_data
    UNION
    SELECT
        'empty_category_id' AS column_name,
        COUNT(CASE WHEN category_id IS NULL THEN 1 END) AS missing_count,
        ROUND(COUNT(CASE WHEN category_id IS NULL THEN 1 END) * 100.0 / COUNT(*), 2) AS percentage
    FROM clean_e_data
    UNION
    SELECT
        'empty_category_code' AS column_name,
        COUNT(CASE WHEN category_code IS NULL THEN 1 END) AS missing_count,
        ROUND(COUNT(CASE WHEN category_code IS NULL THEN 1 END) * 100.0 / COUNT(*), 2) AS percentage
    FROM clean_e_data
    UNION
    SELECT
        'empty_brand' AS column_name,
        COUNT(CASE WHEN brand IS NULL THEN 1 END) AS missing_count,
        ROUND(COUNT(CASE WHEN brand IS NULL THEN 1 END) * 100.0 / COUNT(*), 2) AS percentage
    FROM clean_e_data
    UNION
    SELECT
        'empty_price' AS column_name,
        COUNT(CASE WHEN price = 0 OR price IS NULL THEN 1 END) AS missing_count,
        ROUND(COUNT(CASE WHEN price = 0 OR price IS NULL THEN 1 END) * 100.0 / COUNT(*), 2) AS percentage
    FROM clean_e_data
    UNION
    SELECT
        'empty_user_id' AS column_name,
        COUNT(CASE WHEN user_id IS NULL THEN 1 END) AS missing_count,
        ROUND(COUNT(CASE WHEN user_id IS NULL THEN 1 END) * 100.0 / COUNT(*), 2) AS percentage
    FROM clean_e_data
)

SELECT
    column_name,
    missing_count,
    percentage
FROM MissingValuesCTE
ORDER BY
    CASE
        WHEN column_name = 'empty_event_time' THEN 1
        WHEN column_name = 'empty_order_id' THEN 2
        WHEN column_name = 'empty_product_id' THEN 3
        WHEN column_name = 'empty_category_id' THEN 4
        WHEN column_name = 'empty_category_code' THEN 5
        WHEN column_name = 'empty_brand' THEN 6
        WHEN column_name = 'empty_price' THEN 7
        WHEN column_name = 'empty_user_id' THEN 8
    END;

8 rows affected.

+---------------------+---------------+------------+
|     column_name     | missing_count | percentage |
+---------------------+---------------+------------+
|   empty_event_time  |       0       |    0.00    |
|    empty_order_id   |       0       |    0.00    |
|   empty_product_id  |       0       |    0.00    |
|  empty_category_id  |       0       |    0.00    |
| empty_category_code |     606989    |   27.78    |
|     empty_brand     |     111892    |    5.12    |
|     empty_price     |       0       |    0.00    |
|    empty_user_id    |    1623072    |   74.27    |
+---------------------+---------------+------------+

## Exploratory Data Analysis (EDA):

### Time Series Analysis

#### Check for outliers on event_time column

In [19]:
%%jupysql

SELECT
    EXTRACT(YEAR FROM event_time) AS year,
    COUNT(1) AS count
FROM clean_e_data
GROUP BY
    EXTRACT(YEAR FROM event_time)
ORDER BY
    EXTRACT(YEAR FROM event_time);

1 rows affected.

+------+---------+
| year |  count  |
+------+---------+
| 2020 | 2185221 |
+------+---------+

##### The dataset includes entries in the event_time column with the year 1970, which can be considered outliers. Given their negligible presence in the dataset, excluding these entries would not significantly impact the overall analysis.

#### Deal with outliers by deleting them

In [18]:
%%jupysql

DELETE FROM clean_e_data
WHERE EXTRACT(YEAR FROM event_time) = 1970;

15551 rows affected.

++
||
++
++

#### What are the top 5 peak hours with the highest purchase activity?

In [13]:
%%jupysql

SELECT
    TO_CHAR(event_time, 'hh:00 AM') AS hour,
    COUNT(*) AS purchase_count
FROM clean_e_data
GROUP BY hour
ORDER BY purchase_count DESC
LIMIT 5;

5 rows affected.

+----------+----------------+
|   hour   | purchase_count |
+----------+----------------+
| 10:00 AM |     248724     |
| 09:00 AM |     239871     |
| 11:00 AM |     227718     |
| 08:00 AM |     226015     |
| 07:00 AM |     224365     |
+----------+----------------+

#### Is there a significant variation in the number of daily purchases, indicating potential fluctuations in customer activity?

In [14]:
%%jupysql

SELECT
    TO_CHAR(event_time, 'Day') AS day,
    COUNT(*) AS purchase_count
FROM clean_e_data
GROUP BY day
ORDER BY MIN(event_time);

7 rows affected.

+-----------+----------------+
|    day    | purchase_count |
+-----------+----------------+
| Sunday    |     309933     |
| Monday    |     308244     |
| Tuesday   |     318760     |
| Wednesday |     302953     |
| Thursday  |     292044     |
| Friday    |     325462     |
| Saturday  |     327825     |
+-----------+----------------+

##### The results show that there is a significant variation in the number of daily purchases.

#### What patterns or seasonality trends do we observe in the number of purchases across different months?

In [15]:
%%jupysql

SELECT
    TO_CHAR(event_time, 'Month') AS month,
    COUNT(*) AS purchase_count
FROM clean_e_data
GROUP BY month
ORDER BY MIN(event_time);

11 rows affected.

+-----------+----------------+
|   month   | purchase_count |
+-----------+----------------+
| January   |     206655     |
| February  |     257183     |
| March     |     253049     |
| April     |     55243      |
| May       |     186512     |
| June      |     325905     |
| July      |     150357     |
| August    |     268025     |
| September |     311077     |
| October   |     103917     |
| November  |     67298      |
+-----------+----------------+

### Product Analysis:

#### Explore the distribution of product prices

In [15]:
%%jupysql

SELECT
    MIN(price) AS min_price,
    MAX(price) AS max_price,
    ROUND(AVG(price), 2) AS avg_price,
    PERCENTILE_CONT(0.25) WITHIN GROUP (ORDER BY price) AS q1_price,
    PERCENTILE_CONT(0.50) WITHIN GROUP (ORDER BY price) AS median_price,
    PERCENTILE_CONT(0.75) WITHIN GROUP (ORDER BY price) AS q3_price,
    COUNT(*) AS total_products
FROM clean_e_data;

1 rows affected.

+-----------+-----------+-----------+----------+--------------+----------+----------------+
| min_price | max_price | avg_price | q1_price | median_price | q3_price | total_products |
+-----------+-----------+-----------+----------+--------------+----------+----------------+
|    0.02   |  50925.9  |   154.20  |  14.56   |    55.53     |  196.74  |    2185221     |
+-----------+-----------+-----------+----------+--------------+----------+----------------+

#### Check products with min_price and max_price if we can consider them as outliers

In [12]:
%%jupysql

-- Checking min price

SELECT price, category_code, brand
FROM clean_e_data
WHERE price = 0.02
GROUP BY price, category_code, brand
ORDER BY price 
LIMIT 20;

14 rows affected.

+-------+--------------------+------------+
| price |   category_code    |   brand    |
+-------+--------------------+------------+
|  0.02 | computers.notebook |    none    |
|  0.02 |        None        |    ava     |
|  0.02 |        None        | designskin |
|  0.02 |        None        |   ikins    |
|  0.02 |        None        |   lamart   |
|  0.02 |        None        | montblanc  |
|  0.02 |        None        |    none    |
|  0.02 |        None        |  samsung   |
|  0.02 |        None        |    sbs     |
|  0.02 |        None        |    sony    |
|  0.02 |        None        |   spigen   |
|  0.02 |        None        |   temdan   |
|  0.02 |        None        |   usams    |
|  0.02 |        None        |    None    |
+-------+--------------------+------------+

In [11]:
%%jupysql

-- Checking max price

SELECT price, category_code, brand
FROM clean_e_data
WHERE price = 50925.9
GROUP BY price, category_code, brand
ORDER BY price 
LIMIT 20;

1 rows affected.

+---------+----------------------+---------+
|  price  |    category_code     |  brand  |
+---------+----------------------+---------+
| 50925.9 | electronics.video.tv | samsung |
+---------+----------------------+---------+

##### After thorough examination of both the minimum and maximum prices, no products meet the criteria for being classified as outliers.

#### What are the seasonal sales trends for each product category, and how do they compare to the previous season? Additionally, which product category consistently achieves the highest sales in each season, and how does this performance evolve over time?

In [8]:
%%jupysql

WITH SeasonalProducts AS (
  SELECT
    SUBSTRING(category_code FROM 1 FOR POSITION('.' IN category_code || '.') - 1) AS category,
    CASE
      WHEN EXTRACT(MONTH FROM event_time) IN (12, 1, 2) THEN 'Winter'
      WHEN EXTRACT(MONTH FROM event_time) IN (3, 4, 5) THEN 'Spring'
      WHEN EXTRACT(MONTH FROM event_time) IN (6, 7, 8) THEN 'Summer'
      WHEN EXTRACT(MONTH FROM event_time) IN (9, 10, 11) THEN 'Fall'
      ELSE 'Unknown'
    END AS season,
    COUNT(*) AS purchase_count
  FROM clean_e_data
  GROUP BY category, season
)

SELECT
  COALESCE(category, 'Unknown') AS category,
  season,
  purchase_count,
  SUM(purchase_count) OVER (PARTITION BY category ORDER BY season) AS running_total,
  LAG(purchase_count) OVER (PARTITION BY category ORDER BY season) AS previous_season_sales
FROM SeasonalProducts
ORDER BY category, season;

56 rows affected.

+--------------+--------+----------------+---------------+-----------------------+
|   category   | season | purchase_count | running_total | previous_season_sales |
+--------------+--------+----------------+---------------+-----------------------+
| accessories  |  Fall  |      2877      |      2877     |          None         |
| accessories  | Spring |      2544      |      5421     |          2877         |
| accessories  | Summer |      4013      |      9434     |          2544         |
| accessories  | Winter |      4082      |     13516     |          4013         |
|   apparel    |  Fall  |      1316      |      1316     |          None         |
|   apparel    | Spring |      2499      |      3815     |          1316         |
|   apparel    | Summer |      2343      |      6158     |          2499         |
|   apparel    | Winter |      1460      |      7618     |          2343         |
|  appliances  |  Fall  |     128777     |     128777    |          None         |
|  appliances  | Spring |     138887     |     267664    |         128777        |
|  appliances  | Summer |     225551     |     493215    |         138887        |
|  appliances  | Winter |     112209     |     605424    |         225551        |
|     auto     |  Fall  |      990       |      990      |          None         |
|     auto     | Spring |      540       |      1530     |          990          |
|     auto     | Summer |      1064      |      2594     |          540          |
|     auto     | Winter |      634       |      3228     |          1064         |
|  computers   |  Fall  |     54748      |     54748     |          None         |
|  computers   | Spring |     50027      |     104775    |         54748         |
|  computers   | Summer |     79173      |     183948    |         50027         |
|  computers   | Winter |     37322      |     221270    |         79173         |
| construction |  Fall  |      3368      |      3368     |          None         |
| construction | Spring |      2520      |      5888     |          3368         |
| construction | Summer |      3847      |      9735     |          2520         |
| construction | Winter |      2792      |     12527     |          3847         |
| country_yard |  Fall  |       82       |       82      |          None         |
| country_yard | Spring |       52       |      134      |           82          |
| country_yard | Summer |      154       |      288      |           52          |
| country_yard | Winter |       27       |      315      |          154          |
| electronics  |  Fall  |     116898     |     116898    |          None         |
| electronics  | Spring |     125270     |     242168    |         116898        |
| electronics  | Summer |     190723     |     432891    |         125270        |
| electronics  | Winter |     111498     |     544389    |         190723        |
|  furniture   |  Fall  |     27493      |     27493     |          None         |
|  furniture   | Spring |     25497      |     52990     |         27493         |
|  furniture   | Summer |     37361      |     90351     |         25497         |
|  furniture   | Winter |     30096      |     120447    |         37361         |
|     kids     |  Fall  |      1155      |      1155     |          None         |
|     kids     | Spring |      941       |      2096     |          1155         |
|     kids     | Summer |      2370      |      4466     |          941          |
|     kids     | Winter |      508       |      4974     |          2370         |
|   medicine   |  Fall  |      644       |      644      |          None         |
|   medicine   | Spring |      821       |      1465     |          644          |
|   medicine   | Summer |      1367      |      2832     |          821          |
|   medicine   | Winter |      528       |      3360     |          1367         |
|    sport     |  Fall  |      726       |      726      |          None         |
|    sport     | Spring |      421       |      1147     |          726          |
|    sport     | Summer |      643       |      1790     |          421          |
|    sport     | Winter |      100       |      1890     |          643          |
|  stationery  |  Fall  |      8738      |      8738     |          None         |
|  stationery  | Spring |      8935      |     17673     |          8738         |
|  stationery  | Summer |     10834      |     28507     |          8935         |
|  stationery  | Winter |     10767      |     39274     |         10834         |
|   Unknown    |  Fall  |     134480     |     134480    |          None         |
|   Unknown    | Spring |     135850     |     270330    |         134480        |
|   Unknown    | Summer |     184844     |     455174    |         135850        |
|   Unknown    | Winter |     151815     |     606989    |         184844        |
+--------------+--------+----------------+---------------+-----------------------+

#### What brand and category has the most sales on each season?

In [14]:
%%jupysql

WITH SeasonalProducts AS (
  SELECT
    brand,
    SUBSTRING(category_code FROM 1 FOR POSITION('.' IN category_code || '.') - 1) AS category,
    CASE
      WHEN EXTRACT(MONTH FROM event_time) IN (12, 1, 2) THEN 'Winter'
      WHEN EXTRACT(MONTH FROM event_time) IN (3, 4, 5) THEN 'Spring'
      WHEN EXTRACT(MONTH FROM event_time) IN (6, 7, 8) THEN 'Summer'
      WHEN EXTRACT(MONTH FROM event_time) IN (9, 10, 11) THEN 'Fall'
      ELSE 'Unknown'
    END AS season,
    COUNT(*) AS purchase_count
  FROM clean_e_data
  GROUP BY brand, category, season
),
RankedCategories AS (
  SELECT
    brand,
    category,
    season,
    purchase_count,
    RANK() OVER (PARTITION BY season ORDER BY purchase_count DESC) AS category_rank
  FROM SeasonalProducts
)
SELECT
  brand,
  category,
  season,
  purchase_count,
  category_rank
FROM RankedCategories
WHERE category_rank = 1
ORDER BY season;

4 rows affected.

Deploy AI and data apps for free on Ploomber Cloud! Learn more: https://docs.cloud.ploomber.io/en/latest/quickstart/signup.html

+---------+-------------+--------+----------------+---------------+
|  brand  |   category  | season | purchase_count | category_rank |
+---------+-------------+--------+----------------+---------------+
| samsung | electronics |  Fall  |     50054      |       1       |
| samsung | electronics | Spring |     52093      |       1       |
| samsung | electronics | Summer |     89659      |       1       |
| samsung | electronics | Winter |     38622      |       1       |
+---------+-------------+--------+----------------+---------------+

#### What are the top 5 selling products, considering both brand and category_code?

In [15]:
%%jupysql

WITH product_ranking AS (
  SELECT
    COALESCE(brand, 'unknown') AS brand,
    COALESCE(category_code, 'unknown') AS category_code,  
    COUNT(*) AS purchase_count,
    DENSE_RANK() OVER (ORDER BY COUNT(*) DESC) AS sales_rank
  FROM clean_e_data
  GROUP BY brand, category_code
)

SELECT 
  brand,
  category_code,
  purchase_count,
  sales_rank
FROM product_ranking  
WHERE sales_rank <= 5
ORDER BY sales_rank;

5 rows affected.

+---------+------------------------+----------------+------------+
|  brand  |     category_code      | purchase_count | sales_rank |
+---------+------------------------+----------------+------------+
| samsung | electronics.smartphone |     177888     |     1      |
| unknown |        unknown         |     55054      |     2      |
|  huawei | electronics.smartphone |     46343      |     3      |
|  apple  | electronics.smartphone |     45589      |     4      |
|   oppo  | electronics.smartphone |     35977      |     5      |
+---------+------------------------+----------------+------------+

### Conclusion

Here are some my insights:

- Accessories, appliances, electronics, furniture and stationery tend to see higher quarterly sales compared to other categories like country yard, kids, sport, etc. This indicates they are likely more essential/common product categories.

- Most categories see higher sales in summer compared to other seasons. This suggests summer may be a peak shopping/usage season for many product types.

- Appliances, computers, electronics have the highest absolute sales numbers, indicating they are large volume categories.

- The "None" category grows substantially each quarter, likely capturing miscellaneous/generic purchases. It has the largest overall sales.

- Many categories see sales growth from the previous equivalent season (e.g. spring vs spring), suggesting an overall market expansion. However a few like auto, country yard, construction fluctuate more.

- The running total column steadily increases for most categories, showing cumulative growth over time rather than declines.

- Medicine, kids and sport have relatively modest and fluctuating sales, indicating they may be more optional/niche categories.

In summary, this data points to an overall expansion in the marketplace with peak summer shopping season. Large staple categories dominate sales while others are smaller and more variable. Most products/services see sequential and cumulative growth patterns.